icofoam-cases/buoyant-cavity-2d-dt=15/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

nu              [0 2 -1 0 0 0 0] 1.5e-5;
DT              [0 2 -1 0 0 0 0] 2.5e-5;

T0              [0 0 0  1 0 0 0] 298;
beta            [0 0 0 -1 0 0 0] 0.003356;

g               [0 1 -2 0 0 0 0] (0 -9.806 0);

// ************************************************************************* //
