icofoam-cases/buoyant-cavity-2d-dt=15/0/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

T0              298;
T1              313;

internalField   uniform $T0;

boundaryField
{
    coldWall
    {
        type    fixedValue;
        value   uniform $T0;
    }

    hotWall
    {
        type    fixedValue;
        value   uniform $T1;
    }

    insulatedWalls
    {
        type    zeroGradient;
    }

    frontAndBack
    {
        type    empty;
    }
}

// ************************************************************************* //
